---
kind: property
id: P:Autodesk.Revit.DB.ColorOptions.CalculatingColor
source: html/66d69149-ad97-d7b4-8355-c05322916219.htm
---
# Autodesk.Revit.DB.ColorOptions.CalculatingColor Property

The color of the current canvas theme used to render elements when some aspect of their properties is currently being recalculated.

## Syntax (C#)
```csharp
public Color CalculatingColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null